[
    {
        "date": "1 April",
        "name": [
            " Aprils Fool’s Day",
            "Odisha Foundation Day"
        ],
        "desc": [
            "April Fool's Day is also known as All Fool's Day and is celebrated since centuries but its origins are uncertain. According to some historians, it was first celebrated in 1852, when France switched from the Julian calendar to the Gregorian calendar and some say that it is related to the turn of the seasons.",

            "Odisha Foundation Day is celebrated on 1st April every year in memory to become a separate province on 1 April 1936. "
        ]
    },
    {
        "date": "4 April",
        "name": [
            "International Day of Mine awareness"
        ],
        "desc": [
            "Every Year on 4 April International Day for Mine Awareness and Assistance in Mine Action is observed to spread the awareness about the threat caused by landmines to the safety, health and lives of civilian populations and encourages state Governments to develop mine-clearing programmes."
        ]
    },
    {
        "date": "5 April",
        "name": [
            " National Maritime Day"
        ],
        "desc": [
            "On 5th April every year in India National Maritime day is observed because on this date in 1919 navigation history was created SS Loyalty, the first ship of The Scindia Steam Navigation Company Ltd journeyed to the United Kingdom. It was a red-letter day in the account of Indian navigation."
        ]
    },
    {
        "date": "7 April",
        "name": [
            "World Health Day"
        ],
        "desc": [
            "As we know that 'Health is wealth'.                                        Therefore, World Health Day is celebrated worldwide every year on 7th April. Various programs and arrangements are managed by the World Health Organisation. It was first time celebrated in 1950."
        ]
    },
    {
        "date": "10 April",
        "name": [
            "World Homoeopathy Day (WHD)",
            "Siblings Day"
        ],
        "desc": [
            "WHD is observed every year on 10 April to pay tribute to the founder and father of Homeopathy system of medicine Dr. Christian Friedrich Samuel Hahnemann. The main aim of this day is to spread knowledge about Homeopathic medicine in public health. In fact from 10 April to 16 April World Homeopathy Week is celebrated annually which is organised by the World Homeopathy Awareness Organisation. Basically, this day is celebrated to both for homoeopaths and also for those who have been healed with homoeopathy.",

            "Siblings are an important part of our lives. One cannot imagine his or her life without siblings. To honour our siblings, to show affection, to appreciate one another -- National Siblings Day is celebrated every year on April 10. In India, the occasion of Raksha Bandhan celebrates the special bond between the siblings. Siblings Day is celebrated in many parts of the world like United Kingdom, Australia, India etc. but is not federally recognized. "
        ]
    },
    {
        "date": "11 April",
        "name": [
            "National Safe Motherhood Day (NSMD)"
        ],
        "desc": [
            "NSMD is observed on 11 April every year to create awareness about maternity facilities, lactating women and also for proper health care given to women."
        ]
    },
    {
        "date": "13 April",
        "name": [
            " Jallianwala Bagh Massacre"
        ],
        "desc": [
            "It took place on 13 April 1919 at Amritsar and is also known as Amritsar massacre. On this day, British troops under the Command of Gen Dyer fired on a large crowd of unarmed Indians in Amritsar in Punjab of India. Several hundred peoples were killed and many hundreds were wounded."
        ]
    },
    {
        "date": "14 April",
        "name": [
            "B.R. Ambedkar Remembrance Day"
        ],
        "desc": [
            "B.R. Ambedkar Remembrance Day is also known as Ambedkar Jayanti or Bhim Jayanti which is observed on 14 April to commemorate the memory of B.R Ambedkar. This day celebrates the birthday of Baba Saheb Bhimrao Ambedkar, an Indian politician and social rights activist."
        ]
    },
    {
        "date": "17 April",
        "name": [
            "World Haemophilia Day"
        ],
        "desc": [
            "World Haemophilia Day is observed on 17 April every year to increase awareness about haemophilia disease and other inherited bleeding disorders. In 1989, World Haemophilia Day was started by the World Federation of Haemophilia (WFH) in honour of WFH founder Frank Schnavel's birthday."
        ]
    },
    {
        "date": "18 April",
        "name": [
            "World Heritage Day"
        ],
        "desc": [
            "This day is observed every year on 18 April to preserve the human heritage and recognise the efforts of all the relevant organisations in the field. This day was announced by the International Council on Monuments and Sites (ICOMOS) in 1982 and was approved by the General Assembly of UNESCO in 1983."
        ]
    },
    {
        "date": "21 April",
        "name": [
            " National Civil Service Day"
        ],
        "desc": [
            "Every year on 21 April Civil Service Day is celebrated to rededicate and to recommit themselves to the cause of the people. On this day Civil servants from various parts of the country come together, share their experiences and also learn other's experiences of working in the public sector."
        ]
    },
    {
        "date": "22 April",
        "name": [
            " World Earth Day"
        ],
        "desc": [
            "This day is observed every year on 22 April to mark the anniversary of the birth of the modern environmental movement in 1970. In the Universe Earth is the only planet where life is possible and so it is necessary to maintain this natural asset. World Earth Day is celebrated to increase awareness about the importance of the planet."
        ]
    },
    {
        "date": "23 April",
        "name": [
            " World Book and Copyright Day",
            " English Language Day"
        ],
        "desc": [
            "Every year on 23rd April this day is celebrated to promote the enjoyment of books and reading. It is necessary to recognise the magical powers of books because they generate a link between the past and the future, a bridge between generations and across cultures.",

            "English Language Day is celebrated on 23 April annually and is a United Nations (UN) observance day. The day coincides with both birthday and death day of William Shakespeare and World Book Day"
        ]
    },
    {
        "date": "24 April",
        "name": [
            "National Panchayati Raj Day",
            "Sachin Tendulkar's Birthday"
        ],
        "desc": [
            "National Panchayati Raj Day is celebrated every year on 24 April in India. On this day Constitution came into force with effect from 24 April, 1993. In 2010 the first National Panchayati Raj Day was celebrated. A new part in the Constitution Part IX was added by passing 73rd Amendment Act from Article 243 to 243 (O) titled 'The Panchayats' and a new Eleventh Schedule consisting of 29 subjects within the functions of Panchayats were also added.",

            "The God of Cricket has set an example as the best cricketer who was loved by all the people in the world. He is an inspiration to millions of people and is also known as a master blaster, little master etc."
        ]
    },
    {
        "date": "25 April",
        "name": [
            " World Malaria Day"
        ],
        "desc": [
            "World Malaria Day is celebrated every year on 25 April to raise awareness about the disease malaria, how to control it and how to eradicate it completely. In 2008, first Malaria Day was celebrated, which was developed from Africa Malaria Day, which was an event observed since 2001 by the African governments. In the 60th session of the World Health Assembly in 2007, it was proposed that Africa Malaria Day can be changed to World Malaria Day."
        ]
    },
    {
        "date": "26 April",
        "name": [
            " World Intellectual Property Day"
        ],
        "desc": [
            "26 April - World Intellectual Property Day... This day is celebrated every year on 26 April and was established by the World Intellectual Property Organisation (WIPO) in 2000 to raise awareness of how patents, copyright, trademarks and designs impact on daily life. And also it plays an important role that intellectual property rights play in encouraging innovation and creativity."
        ]
    },
    {
        "date": "27 April",
        "name": [
            " World Veterinary Day"
        ],
        "desc": [
            "World Veterinary Day is observed on every last Saturday of April month globally to raise awareness in the public about the important roles veterinarians plays. The World Organisation creates this day for Animal Health and the World Veterinary Association."
        ]
    },
    {
        "date": "28 April",
        "name": [
            " World Day for Safety and Health at Work"
        ],
        "desc": [
            "This day is observed on 28 April every year by the International Labour Organisation (ILO) since 2003. This day marks how to improve occupational safety, health and looks for continuing these efforts through several changes like technology, demographics, climate change etc."
        ]
    }
]