[
    {
        "date": "1 August",
        "name": [
            "National Mountain Climbing Day",
            "Yorkshire Day"
        ],
        "desc": [
            "Every year on 1st August National Mountain Climbing Day is observed. It is said that the day was established in honour of the author's son, Bobby Mathews, and his friend Josh Madigan, for successfully climbing the 46 High Peaks of New York State's Adirondack Mountains.",

            "Yorkshire Day is celebrated every year on 1st August. It is the UK's largest country. This day is celebrated to honour everything about the history of the country to its most memorable residents."
        ]
    },
    {
        "date": "4 August",
        "name": [
            "U.S. Coast Guard Day"
        ],
        "desc": [
            "Every year on 4 August U.S. Coast Guard Day is observed to honour the establishment of the Revenue Marine on 4 August in 1790 by the Secretary of the Treasury Alexander Hamilton."
        ]
    },
    {
        "date": "6 August",
        "name": [
            "Hiroshima Day"
        ],
        "desc": [
            "Hiroshima Day is observed on 6 August every year. This is the day when the atomic bomb was dropped on the Japanese city of Hiroshima."
        ]
    },
    {
        "date": "7 August",
        "name": [
            "National Handloom Day"
        ],
        "desc": [
            "It is observed on 7 August every year to honour the handloom weavers in the country. This year 6th National Handloom Day is celebrated."
        ]
    },
    {
        "date": "8 August",
        "name": [
            "Quit India Movement Day"
        ],
        "desc": [
            "All India Congress Committee session in Bombay on 8 August, 1942, Mohandas Karamchand Gandhi launched the 'Quit India Movement'. It is also known as August Movement or August Kranti."
        ]
    },
    {
        "date": "9 August",
        "name": [
            " Nagasaki Day",
            "International Day of the World's Indigenous Peoples"
        ],
        "desc": [
            "The United States on 9 August, 1945 dropped a second bomb on Japan at Nagasaki and the bomb is also known as ‘Fat Man’. It was dropped three days after the atomic bombing of Hiroshima.",

            "Every year International Day of the World's Indigenous Peoples is celebrated on 9 August to encourage people from around the world to spread the UN's message on the protection and promotion of the rights of indigenous peoples."
        ]
    },
    {
        "date": "12 August",
        "name": [
            "International Youth Day",
            "World Elephant Day"
        ],
        "desc": [
            "International Youth Day is celebrated on 12 August around the globe to focus on the development and protection of youth in the society. ",

            "It is observed on 12 August annually to make people understand to preserve and protect the giant animal elephant. This is the way to bring the world together to help elephants."
        ]
    },
    {
        "date": "13 August",
        "name": [
            "International Lefthanders Day",
            "World Organ Donation Day"
        ],
        "desc": [
            "Every year on 13 August Lefthanders Day is observed. It raises awareness about the problems and difficulties that left handed persons faced.",

            "World Organ Donation Day is observed on 13 August to spread awareness about the importance of organ donation.  "
        ]
    },
    {
        "date": "15 August",
        "name": [
            "Independence Day in India",
            "National Mourning Day (Bangladesh)",
            "Day of the Assumption of the Virgin Mary"
        ],
        "desc": [
            "Every Year on 15 August, India celebrates Independence Day. As on this day, India got freedom from British rule. It makes us remind about a new beginning, the beginning of a new era free from British colonialism of more than 200 years.",

            "On 15 August, National Mourning Day in Bangladesh is observed. On this day Bangladesh's first President Sheikh Mujibur Rahman was assassinated along with most of his family members.",

            "On 15 August, the Christian feast day of the Assumption of Mary is celebrated with the belief that God assumed the Virgin Mary into Heaven following her death. Mainly, it is celebrated in parts of Europe and South America. It is also called the Assumption of the Blessed Virgin Mary."
        ]
    },
    {
        "date": "16 August",
        "name": [
            "Bennington Battle Day"
        ],
        "desc": [
            "Bennington Battle Day is observed on 16 August annually to honour the Battle of Bennington which took place on 16 August, 1777."
        ]
    },
    {
        "date": "17 August",
        "name": [
            "Indonesian Independence Day"
        ],
        "desc": [
            "Indonesian Independence Day is celebrated on 17 August every year. This day is celebrated as the declaration of independence from Dutch colonization in 1945."
        ]
    },
    {
        "date": "19 August",
        "name": [
            "World Photography Day",
            "World Humanitarian Day"
        ],
        "desc": [
            "World Photography Day is observed on 19 August annually to raise awareness about the importance of photography.",

            "World Humanitarian Day is observed annually on 19 August around the world to pay tribute to aid workers who risk their lives in humanitarian service. This day also honour the work of women in crises throughout the world. "
        ]
    },
    {
        "date": "20 August",
        "name": [
            "World Mosquito Day",
            "Sadbhavna Diwas",
            "Indian Akshay Urja Day"
        ],
        "desc": [
            "World Mosquito Day is observed on 20 August every year to commemorate the British doctor, Sir Ronald Ross's discovery in 1897 that 'female mosquitoes transmit malaria between humans'.",

            "Sadbhavna Divas is observed on 20 August every year to commemorate the memory of our late Prime Minister Rajiv Gandhi. In English, Sadbhavna means goodwill and bonafide.",

            "Indian Akshay Urja Day is celebrated on 20 August annually to raise awareness about the development of renewable energy in India. It is a campaign that is celebrated since 2004. This day commemorates the birthday of former Prime Minister Rajiv Gandhi."
        ]
    },
    {
        "date": "23 August",
        "name": [
            "International Day for the Remembrance of the Slave Trade and its Abolition",
            "European Day of Remembrance for Victims of Stalinism and Nazism"
        ],
        "desc": [
            "This day is observed on 23 August every year to remind us about the tragedy of the slave trade in memory of all peoples that is about the tragedy of the transatlantic slave trade. It provides a chance to think about the historic causes and the consequences of the slave trade.",

            "This day is observed on 23 August every year as a remembrance day for victims of totalitarian regimes mainly Communism, Fascism, Nazism, etc. It is also known as Black Ribbon Day in some countries. This day also symbolises the rejection of 'extremism, intolerance, and oppression'."
        ]
    },
    {
        "date": "26 August",
        "name": [
            "Women's Equality Day",
            "International Dog Day"
        ],
        "desc": [
            "This day commemorates the passage of the 19th Amendment to the U.S. Constitution which granted the women right to vote. In 1971, the U.S. Congress officially recognized August 26 as Women's Equality Day.",

            "It is celebrated on 26 August to recognise the number of dogs that need to be rescued each year."
        ]
    },
    {
        "date": "29 August",
        "name": [
            "National Sports Day"
        ],
        "desc": [
            "National Sports Day is celebrated on 29 August every year to honour the birthday of Dhyan Chand a field hockey player. National Sports Day is also known as Rashtriya Khel Divas."
        ]
    },
    {
        "date": "30 August",
        "name": [
            "Small Industry Day"
        ],
        "desc": [
            "Small Industry Day is observed on 30 August every year to support and promote small scale industries. Do you know that small scale industries are privately owned small corporations or manufacturers with limited resources and manpower?"
        ]
    },
    {
        "date": "31 August",
        "name": [
            "Hari Merdeka (Malaysia National Day)"
        ],
        "desc": [
            "Every year Hari Merdeka (Malaysia National Day) is celebrated on 31 August."
        ]
    }
]