[
    {
        "date": "1 December",
        "name": [
            "World AIDS Day"
        ],
        "desc": [
            "World AIDS Day is observed on 1 December every year to raise awareness and knowledge about HIV and a call to move toward ending the HIV epidemic. It was first celebrated in 1988. The theme of 2019 is 'Ending the HIV/AIDS Epidemic: Community by Community'. And according to UNAIDS, the theme of this year is 'Communities make the difference'."
        ]
    },
    {
        "date": "2 December",
        "name": [
            "National Pollution Control Day",
            "International Day for the Abolition of Slavery"
        ],
        "desc": [
            "National Pollution Control Day is celebrated on 2 December to raise awareness about pollution and its hazardous effects. This day is observed in the memory of the people who lost their lives in Bhopal gas calamity and is considered as one of the biggest industrial disasters.",

            "It is observed on 2 December to make people aware about the modern slavery that works against human rights. Do you know more than 40 million people in the world are victims of modern slavery? This day reminds the situations of exploitation that a person cannot refuse due to threats, violence, coercion or abuse of power."
        ]
    },
    {
        "date": "3 December",
        "name": [
            "World Day of the Handicapped"
        ],
        "desc": [
            "World Day of the Handicapped is also known as the International Day of People with Disability (IDPwD). It is observed on 3 December to raise awareness about understanding and accepting people with disabilities. The theme for 2019 is ‘Promoting the participation of persons with disabilities and their leadership: taking action on the 2030 Development Agenda’.”"
        ]
    },
    {
        "date": "4 December",
        "name": [
            "Indian Navy Day"
        ],
        "desc": [
            "Indian Navy Day is celebrated every year on 4 December to highlight the role, achievements, and difficulties that Navy people face."
        ]
    },
    {
        "date": "5 December",
        "name": [
            "International Volunteer Day",
            "World Soil Day"
        ],
        "desc": [
            "International Volunteer Day (IVD) is celebrated on 5 December every year. This day provides a chance for volunteers and organisations to celebrate their efforts, values and promote their work among their communities, etc.",

            "World Soil Day is observed on 5 December to raise awareness about the importance of soil, healthy ecosystems and human well-being."
        ]
    },
    {
        "date": "7 December",
        "name": [
            "Armed Forces Flag Day",
            "International Civil Aviation Day"
        ],
        "desc": [
            "Armed Forces Flag Day is observed across the country on 7 December with the objective of collecting funds from the common people and to honour the martyrs and the men who fought with bravery on the borders to safeguard the country's honour.",

            "International Civil Aviation Day is observed on 7 December worldwide to raise awareness about its importance to the social and economic development of States and the role that ICAO plays in International air transport."
        ]
    },
    {
        "date": "9 December",
        "name": [
            " International Anti-Corruption Day"
        ],
        "desc": [
            "International Anti-Corruption Day is observed on 9 December every year to highlight how corruption affects health, education, justice, democracy, prosperity, and development."
        ]
    },
    {
        "date": "10 December",
        "name": [
            "Human Rights Day"
        ],
        "desc": [
            "Human Rights Day is celebrated on 10 December. The Universal Declaration of Human Rights was adopted in 1948 by the United Nations General Assembly. This day is observed to protect the fundamental human rights of all people and their basic human freedom."
        ]
    },
    {
        "date": "11 December",
        "name": [
            "International Mountain Day"
        ],
        "desc": [
            "International Mountain Day is celebrated on 11 December every year to educate children and people about the role that mountains play in providing fresh water, clean energy, food, and recreation. The theme of 2019 is 'Mountains matter for Youth'."
        ]
    },
    {
        "date": "14 December",
        "name": [
            "National Energy Conservation Day"
        ],
        "desc": [
            "It is observed on 14 December to raise awareness about the need for energy and its conservation in daily life. Since 1991, it is celebrated every year on 14 December by the Bureau of Energy Efficiency (BEE), under the Ministry of Power."
        ]
    },
    {
        "date": "15 December",
        "name": [
            "International Tea Day"
        ],
        "desc": [
            "International Tea Day is celebrated annually on 15 December to highlight the effect of the trade of tea globally on the economy, workers, farmers, and society."
        ]
    },
    {
        "date": "16 December",
        "name": [
            "Vijay Diwas"
        ],
        "desc": [
            "Vijay Diwas is celebrated on 16 December in India to remember the martyrs, their sacrifices and to strengthen the role of armed forces for the cause of the nation."
        ]
    },
    {
        "date": "18 December",
        "name": [
            "Minorities Rights Day in India",
            "International Migrants Day"
        ],
        "desc": [
            "Minorities Rights Day in India is observed on 18 December to preserve and promote the rights of minority communities in India. This day focuses on the issues like the safety of minorities in the state. On this day several campaigns, seminars, and events are conducted to inform and educate people about them.",

            "International Migrants Day is celebrated on 18 December to raise awareness about the protection for migrants and refugees. The International Organisation for Migration (IOM) is calling an international community to come together and remember the migrants and refugees who have lost their lives or have disappeared while reaching a safe harbour."
        ]
    },
    {
        "date": "19 December",
        "name": [
            "Goa's Liberation Day"
        ],
        "desc": [
            "The Liberation Day of Goa is celebrated on 19 December annually. On this date in 1961, Goa was released from the Portuguese dominion after army operation and extended freedom movement. This day is celebrated in commemoration of the Indian armed forces that helped Goa to received freedom from Portuguese rule."
        ]
    },
    {
        "date": "20 December",
        "name": [
            "International Human Solidarity Day"
        ],
        "desc": [
            "International Human Solidarity Day is observed on 20 December annually to highlight the importance of unity in diversity. This day also reminds people to work together in fighting against poverty, hunger, and disease."
        ]
    },
    {
        "date": "22 December",
        "name": [
            "National Mathematics Day"
        ],
        "desc": [
            "National Mathematics Day is celebrated on 22 December annually to commemorate the birth anniversary of the famous mathematician Srinivasa Ramanujan. He had made remarkable contributions in various fields of mathematics and its branches. He was born on 22 December 1887 in Erode (today in the city of Tamil Nadu)."
        ]
    },
    {
        "date": "23 December",
        "name": [
            "Kisan Diwas"
        ],
        "desc": [
            "Kisan Divas or Farmer's Day in India or National Farmer's Day is celebrated on 23 December across the country to commemorate the birth anniversary of the former Prime Minister Chaudhary Charan Singh. On this day various events, seminars, functions, and competitions are organised on agriculture and its importance to educate and provide knowledge to the people."
        ]
    },
    {
        "date": "24 December",
        "name": [
            "National Consumer Rights Day"
        ],
        "desc": [
            "National Consumer Rights Day is observed on 24 December annually with a particular theme across the country. The Consumer Protection Act, 1986 had received the assent of the president on this day. No doubt it is considered a historic milestone in the consumer movement in the country. This day also provides awareness about consumer rights and responsibilities."
        ]
    },
    {
        "date": "25 December",
        "name": [
            "Christmas Day",
            "Good Governance Day (India)"
        ],
        "desc": [
            "Christmas Day is celebrated on 25 December worldwide annually to commemorate the birth anniversary of Jesus Christ, the Son of God.",

            "Good Governance Day in India is observed on 25 December to commemorate the birth anniversary of Atal Bihari Vajpayee, His Samadhi namely 'Sadiav Atal' was dedicated to the nation and reflects his personality as a poet, humanist, statesman, and a great leader.<br/> He died at the age of 93 on 16 August, 2018. The Good Governance Day was established in 2014 to pay tribute to the former PM Atal Bihari Vajpayee to raise awareness about the accountability in governance among the people of India."
        ]
    },
    {
        "date": "31 December",
        "name": [
            "New Year's Eve"
        ],
        "desc": [
            "According to the Gregorian calendar, New Year's Eve is celebrated on 31st December as the last day of the year. People gather together to celebrate the evening by dancing, eating, singing, etc. and welcome New Year."
        ]
    }
]
