[
    {
        "date": "1 February",
        "name": [
            "Surajkund Crafts Mela",
            "Indian Coast Guard Day"
        ],
        "desc": [
            "Surajkund Crafts Mela is celebrated at Surajkund, District Faridabad, Haryana from 1st February to 17 February. It is a celebration of Indian folk traditions and cultural heritage. Surajkund International Crafts Mela is also celebrated from 2nd February onwards. In this Mela, richness, and diversity of handicrafts, handlooms and cultural fabric of India are seen. Let us tell you that the Mela is organised by the Surajkund Mela Authority and Haryana Tourism in collaboration with Union Ministries of Tourism, Textiles, Culture and External Affairs. ",

            "On 1st February, the Indian Coast Guard celebrates its foundation day. The interim Indian Coast guard was established on 1 February 1977 to prevent sea-borne smuggling of goods which were hampering India's domestic economy. On 18 August, 1978 Parliament of India passed the coast Guard Act which came into immediate effect. Indian Coast Guard is an armed force of India which protects maritime interests and enforces maritime law, with the jurisdiction over the territorial waters of India. It works in close cooperation with the Department of Fisheries, Indian Navy, the Department of Revenue and the Central and State police forces."
        ]
    },
    {
        "date": "2 February",
        "name": [
            "World Wetlands Day"
        ],
        "desc": [
            "Every year on 2nd February, World Wetlands Day is celebrated internationally. This day marks the date of the adoption of the Convention on Wetlands on 2 February, 1971, in Ramsar, Iran. It was first celebrated in 1997. World Wetlands Day 2020 theme is 'Wetlands and biodiversity'."
        ]
    },
    {
        "date": "4 February",
        "name": [
            "World Cancer Day",
            "National Day of Sri Lanka"
        ],
        "desc": [
            "Every year on 4 February World Cancer Day is observed globally and is celebrated by WHO to aware people of the disease Cancer and how to cure it. 2020 theme is 'I Am and I Will'. According to WHO, the theme is an empowering call-to-action urging for personal commitment and represents the power of individual action taken now to impact the future.",

            "On 4 February every year, Sri Lanka's National Day is celebrated as Independence Day. Sri Lanka got freedom from British rule on 4 February, 1948."
        ]
    },
    {
        "date": "6 February",
        "name": [
            "International Day of Zero Tolerance for Female Genital Mutilation "
        ],
        "desc": [
            "International Day of Zero Tolerance for Female Genital Mutilation is observed on 6 February to spread awareness and educate people about the consequences and problems that females faced due to genital mutilation."
        ]
    },
    {
        "date": "12 February",
        "name": [
            "Darwin Day",
            "Abrahm Lincoln's Birthday"
        ],
        "desc": [
            "12 February is celebrated every year as Darwin Day to commemorate the birth anniversary of the father of evolutionary biology, Charles Darwin in 1809. This day highlights Darwin's contribution to evolutionary and plant science. In 2015, Darwin's ‘Origin of Species’ was voted the most influential academic book in history.",

            "12 February is celebrated as the birthday of the most popular presidents in the United States history namely Abraham Lincoln. This day is also known as Abraham Lincoln's Birthday, Abraham Lincoln Day or Lincoln Day."
        ]
    },
    {
        "date": "13 February",
        "name": [
            "World Radio Day",
            "Sarojini Naidu Birth Anniversary"
        ],
        "desc": [
            "World Radio Day is celebrated on 13 February to raise awareness about the importance of Radio. In several countries, it is the primary source for providing information.",

            "13th February is celebrated as the birth anniversary of the Nightingale of India i.e. Sarojini Naidu. She was born on 13 February, 1879 in Hyderabad to scientist and philosopher Aghornath Chattopadhyaya and Barada Sundari Devi. She was the first Indian woman President of the Indian National Congress and also the first woman governor of an Indian state that is Governor of United Province which is now known as Uttar Pradesh."
        ]
    },
    {
        "date": "18 February",
        "name": [
            "Taj Mahotsav"
        ],
        "desc": [
            "On 18 February every year Taj Mahotsav or Taj Festival is celebrated at Agra that reveals the rich cultural heritage of our country. This festival in begins from 18 February and last till 27 February. No doubt, the Taj Mahal represents the magnificence of the Mughal era and displays the finest specimens of Indian craftsmanship."
        ]
    },
    {
        "date": "20 February",
        "name": [
            "Arunachal Pradesh Foundation Day",
            "World Day of Social Justice"
        ],
        "desc": [
            "Arunachal Pradesh Foundation Day is celebrated on 20 February as on this day it gained the status of the Union Territory and named Arunachal Pradesh. ",

            "World Day of Social Justice is observed every year on 20 February to encourage people to see how social justice affects poverty eradication. The main aim of this day is to achieve full employment and support for social integration. This day tackle issues like poverty, exclusion, and unemployment."
        ]
    },
    {
        "date": "21 February",
        "name": [
            " International Mother Language Day"
        ],
        "desc": [
            "International Mother Language Day is celebrated annually on 21 February worldwide to aware of the diversity of the language and its variety. This day promotes the awareness of language and cultural diversity across the world. On 17 November, 1999, it was first announced by UNESCO."
        ]
    },
    {
        "date": "22 February",
        "name": [
            "World Scout Day"
        ],
        "desc": [
            "22 February every year World Scout Day is celebrated and millions of Scouts from around the world gather at local, national and international levels to celebrate the Founder's Day. This day marks with the birthday of Lord Baden-Powell, the pioneer of Scouting."
        ]
    },
    {
        "date": "24 February",
        "name": [
            "Central Excise Day"
        ],
        "desc": [
            "Central Excise Day is observed in India on 24 February every year to encourage the employees of the excise department to carry out the central excise duty in a better way to prevent corruption in the manufacturing business and to carry out the best possible exercise services in India."
        ]
    },
    {
        "date": "28 February",
        "name": [
            "National Science Day"
        ],
        "desc": [
            "National Science Day is celebrated every year in India on 28 February to mark the discovery of the Raman Effect by the Indian physicist Sir Chandrasekhara Venkata Raman. He discovered the Raman Effect on 28 February, 1928 and for this discovery, he was honoured by the Nobel Prize in Physics subject in 1930."
        ]
    }
]