[
    {
        "date": "1 January",
        "name": [
            "Global Family Day"
        ],
        "desc": [
            "It is celebrated as a day of peace and sharing. Its aim is to unite and spread a message of peace by considering and promoting the idea that Earth is a one Global Family so as to make the world a better place to live for everyone."
        ]
    },
    {
        "date": "8 January",
        "name": [
            "African National Congress Foundation Day"
        ],
        "desc": [
            "South African Native National Congress (SANNC) was founded in 8 January 1912 by John Langalibalele Dube in Bloemfontein. Behind this, the primary motive was to give voting rights to black and mixed-race Africans or to unite African people and spearhead the struggle for fundamental political, social and economic change."
        ]
    },
    {
        "date": "9 January",
        "name": [
            "NRI (Non-Resident Indian) Day or Pravasi Bharatiya Divas"
        ],
        "desc": [
            "NRI or Pravasi Bharatiya Divas observed every year on 9 January to mark the contribution of the overseas Indian community towards the development of India. This day also commemorates the return of Mahatma Gandhi from South Africa to Mumbai on 9 January, 1915."
        ]
    },
    {
        "date": "11 January",
        "name": [
            "Death anniversary of Lal Bahadur Shastri"
        ],
        "desc": [
            "He was the second Prime Minister of Independent India. He popularised the slogan 'Jai Jawan Jai Kisan' He actively participated in India's freedom struggle. Due to cardiac arrest, he died on 11 January, 1966."
        ]
    },
    {
        "date": "12 January",
        "name": [
            "National Youth Day"
        ],
        "desc": [
            "The birth anniversary of Swami Vivekananda also called Swami Vivekananda Jayanti is celebrated every year on 12 January. He was born on 12 January, 1863. The government had decided to observe it as National Youth Day because the philosophy of Swamiji and the ideals for which he lived and worked could be a great source of inspiration for the Indian Youth. He had given a speech at the Parliament of the World's religions in Chicago and glorified India's name."
        ]
    },
    {
        "date": "15 January",
        "name": [
            "Indian Army Day"
        ],
        "desc": [
            "Every year 15 January is observed as Indian Army Day because on this day in 1949 field Marshal Kodandera M Cariappa took over as the first Commander-in-Chief of the Indian Army from General Sir Francis Butcher, the last British Commander-in-Chief."
        ]
    },
    {
        "date": "23 January",
        "name": [
            "Netaji Subhas Chandra Bose Jayanti"
        ],
        "desc": [
            "Netaji Subhash Chandra Bose was born on 23 January, 1897 in Cuttack, Orissa. He was one of the most prominent Indian freedom fighters. His army was known as Indian National Army (INA) or Azad Hind Fauj. He also led an Indian national force from abroad against the Western powers during World War II."
        ]
    },
    {
        "date": "24 January",
        "name": [
            "National Girl Child Day"
        ],
        "desc": [
            "On 24 January every year, National Girl Child Day is celebrated to highlight the inequalities faced by a majority of the girls in India, the importance of education, nutrition, legal rights, medical care and safety of girl children, etc."
        ]
    },
    {
        "date": "25 January",
        "name": [
            "National Voters Day",
            "National Tourism Day"
        ],
        "desc": [
            "Every year on 25 January National Voter's Day or Rashtriya Matdata Diwas is celebrated to encourage young voters to take part in the political process. In 2011 the first time this day was celebrated to mark Election Commission's Foundation Day.",
            "Every year on 25 January National Tourism Day is celebrated in India to raise awareness and educate people about the importance of tourism and the role it plays in the Indian economy."
        ]
    },
    {
        "date": "26 January",
        "name": [
            "International Customs Day"
        ],
        "desc": [
            "International Customs Day (ICD) is celebrated every year on 26 January by Custom Organisation to recognise the role of custom officials and agencies in maintaining border security. It also focuses on the working conditions and challenges that customs officers face in their jobs."
        ]
    },
    {
        "date": "28 January",
        "name": [
            "Birth Anniversary of Lala Lajpat Rai"
        ],
        "desc": [
            "Lala Lajpat Rai was born on 28 January, 1865 in Punjab. He was a prominent nationalist leader who played an important role in India’s struggle for freedom. He also earned the title of 'Punjab Kesari' or 'the Lion of the Punjab'. He initiated the foundation of Punjab National Bank. He died on 17 November, 1928, due to serious injuries. The University of Veterinary and Animal Sciences in Hisar, Haryana is named after Lala Lajpat Rai."
        ]
    },
    {
        "date": "30 January",
        "name": [
            "Martyrs Day or Shaheed Diwas",
            "World Leprosy Eradication Day"
        ],
        "desc": [
            "30 January is celebrated as Martyr's Day or Shaheed Diwas every year in the memory of Mahatma Gandhi and the sacrifice of three revolutionaries of India. As, on 30 January, 1948, the 'Father of Nation' was assassinated. And on 23rd March 3 heroes namely Bhagat Singh, Shivaram Rajguru and Sukhdev Thapar of the nation were hanged to death by British.",
            "World Leprosy Day is observed on 30 January every year to focus on the target of zero cases of leprosy-related disabilities in children. As we know that disabilities do not occur overnight but happen after a prolonged period of undiagnosed disease."
        ]
    }
]