[
    {
        "date": "1 July",
        "name": [
            "National Doctor’s Day",
            "National Postal Worker Day",
            "Canada Day",
            "Chartered Accountants Day",
            "National U.S. Postage Stamp Day",
            "National Gingersnap Day"
        ],
        "desc": [
            "In India, Doctor's Day is observed on 1st July to mark the importance of doctors hold in our lives. This day is also meant to commemorate the medical industry and its advancements.",

            "National Postal Worker Day is observed every year on 1st July to thank and appreciate all men and women who work consistently and diligently to deliver all our mail and packages.",

            "Canada Day is celebrated annually on 1st July and it is a statutory holiday. This day marks the anniversary of the formation of the union of the British North America provinces in a federation under the name of Canada. Canada Day also means fireworks and the year's biggest national party.",

            "The Institute of Chartered Accountants of India (ICAI) was established on 1st July, 1949 and so in India is marked as a  Chartered Accountants Day. It is the second-largest professional accounting and finance body in the world.",

            "National U.S. Postage Stamp Day is celebrated on 1st July every year to commemorate the existence of Postage Stamps that is used for sending letters and to appreciate the extraordinary works of all the Philatelists.",

            "National Gingersnap Day is celebrated on 1st July every year to enjoy this sweet and savoury treat. Do you know Gingersnaps are the cookies mainly made from molasses, cloves, ginger, cinnamon, and brown sugar? Basically, it is a combination of sweet and spicy. They are healthier alternatives to other cookies as they are lower in calories."
        ]
    },
    {
        "date": "2 July",
        "name": [
            "World UFO Day",
            " National Anisette Day"
        ],
        "desc": [
            "World UFO Day is observed on 2nd July. It was founded by the UFO hunter Haktan Akdogan. The first World UFO Day was celebrated in 2001 and spread awareness among people to gaze at the heavens scanning for unidentified flying objects.",

            "National Anisette Day is observed on 2nd July every year and is popular in Spain, Italy, Portugal, and France. Let us tell you that Anisette is anise-flavoured liquor that is made by distilling aniseed and sometimes made by adding sugar."
        ]
    },
    {
        "date": "3 July",
        "name": [
            "National Fried Clam Day"
        ],
        "desc": [
            "National Fried Clam Day is celebrated every year on 3rd July. Fried clam is the process of deep-frying the clams after being coated in the bread crumbs and striping it further. This is a traditional way to prepare fried crumbs."
        ]
    },
    {
        "date": "4 July",
        "name": [
            " Independence Day USA"
        ],
        "desc": [
            "Independence Day USA is celebrated on 4 July. United States Independence Day is also known as the Fourth of July or the Fourth. This day commemorates the adoption of the Declaration of Independence on 4 July, 1776 from the Kingdom of Great Britain."
        ]
    },
    {
        "date": "6 July",
        "name": [
            "World Zoonoses Day"
        ],
        "desc": [
            "World Zoonoses Day is observed every year on 6 July to emphasise and bring problem awareness amongst people and teach them to take the right action. Do you know the first vaccination against a zoonotic disease was administered by Louis Pasteur on 6 July, 1885?"
        ]
    },
    {
        "date": "11 July",
        "name": [
            "World Population Day",
            "National 7-Eleven Day"
        ],
        "desc": [
            "World Population Day is observed annually on 11 July to focus the attention on the urgency and importance of population issues.",

            "National 7-Eleven Day is observed every year on 11 July. On this day 7-Eleven convenience stores reserve special deals for their customers. Every year it honours their customers in a variety of ways."
        ]
    },
    {
        "date": "12 July",
        "name": [
            "National Simplicity Day",
            "Paper Bag Day"
        ],
        "desc": [
            "National Simplicity Day is observed annually on 12 July to honour Henry David Thoreau who was an author, philosopher, historian, tax resister, abolitionist, development critic, surveyor, and leading transcendentalist. Basically, he was an advocate for living a life of simplicity.",

            "Paper Bag Day is observed on 12 July annually to recognise the importance of an invention of Paper Bag that we mostly take it for granted. In 1852, Francis Wolle, a schoolteacher, invented the first machine to mass-produce paper bags."
        ]
    },
    {
        "date": "14 July",
        "name": [
            "Bastille Day or French National Day"
        ],
        "desc": [
            "Bastille Day is celebrated on 14 July every year. This day marks the anniversary of Storming of the Bastille on 14 July, 1789 which is a turning point of the French Revolution."
        ]
    },
    {
        "date": "15 July",
        "name": [
            "World Youth Skills Day"
        ],
        "desc": [
            "World Youth Skills Day is celebrated on 15 July every year to raise awareness about the importance of technical, vocational education & training and the development of other skills relevant to both local and global economies."
        ]
    },
    {
        "date": "17 July",
        "name": [
            "World Day for International Justice",
            " World Emoji Day"
        ],
        "desc": [
            "World Day for International Justice is observed annually on 17 July every year. It is also known as the Day of International Criminal Justice or International Justice Day. This day recognise the emerging system of international criminal justice.",

            "World Emoji Day is observed on 17 July every year since 2014. The day is celebrated to represent an idea or an emotion through an electronic means. "
        ]
    },
    {
        "date": "18 July",
        "name": [
            "International Nelson Mandela Day"
        ],
        "desc": [
            "International Nelson Mandela Day is observed on 18 July every year. The day celebrates Mandela's life and legacy in a sustainable way that will bring about the needful changes."
        ]
    },
    {
        "date": "22 July",
        "name": [
            "Pi Approximation Day",
            "National Mango Day or Mango Day"
        ],
        "desc": [
            "Pi Approximation Day is observed on 22 July every year because of the value of Pi that is 22/7. Whereas Pi Day is celebrated on 14 March which is similar to the approximate value of 3.14 and also coincides with Albert Einstein’s birthday.",

            "It is celebrated on 22 July. The day is to know about the history and some lesser-known facts about the juicy and delicious fruit mango"
        ]
    },
    {
        "date": "24 July",
        "name": [
            "National Thermal Engineer Day"
        ],
        "desc": [
            "National Thermal Engineer Day is observed every year on 24 July to show the importance of advancing the thermal engineering industry and is provide the electronics industry with innovative, high-quality, and cost-effective thermal management and its packaging solutions."
        ]
    },
    {
        "date": "26 July",
        "name": [
            "Kargil Vijay Diwas"
        ],
        "desc": [
            "Kargil Vijay Diwas is observed on 26 July and is named after the success of the Operation Vijay. The Kargil war was ended on 26 July which continued approx 60 days. This day is celebrated to honour the Kargil War Heroes."
        ]
    },
    {
        "date": "28 July",
        "name": [
            "World Nature Conservation Day",
            "World Hepatitis Day"
        ],
        "desc": [
            "World Nature Conservation Day is observed on 28 July every year to recognise that a healthy environment is a foundation for a stable and productive society and for future generations. We must protect, conserve and sustainably manage our natural resources.",

            "World Hepatitis Day is observed annually on 28 July to generate an opportunity to step up national and international efforts on hepatitis. Also, this day make people aware of the hepatitis disease and its consequences in the life of the people suffering from it."
        ]
    },
    {
        "date": "29 July",
        "name": [
            " International Tiger Day"
        ],
        "desc": [
            "International Tiger Day is observed every year on 29 July to spread awareness about the need for conservation of Tigers, promote the protection of the natural habitat of tigers. This day is also known as Global Tiger Day."
        ]
    },
    {
        "date": "30 July",
        "name": [
            "International Friendship Day"
        ],
        "desc": [
            "International Friendship Day is celebrated on 30 July to mark the importance of friends and friendship in life. The day also advocates the role that friendship plays in promoting peace in several cultures across the world."
        ]
    }
]