[
    {
        "date": "1 June",
        "name": [
            "World Milk Day",
            "Global Day of Parents"
        ],
        "desc": [
            "World Milk Day is observed globally on 1st June every year to celebrate the important contributions of the dairy sector to sustainability, economic development, livelihoods and nutrition.  ",

            "The Global Day of Parents is celebrated on the 1st of June every year. UN General Assembly proclaimed this day in 2012 by passing a resolution and honours parents for their relentless support, sacrifice and commitments towards their children."
        ]
    },
    {
        "date": "2 June",
        "name": [
            "Telangana Formation Day"
        ],
        "desc": [
            "Telangana has a glorious history of at least two thousand five hundred years or more. Every year Telangana State celebrates the formation day on 2nd June with grandeur and conducts various events, cultural activities etc. The struggle of Telangana to generate a new state began in the early 1950s."
        ]
    },
    {
        "date": "3 June",
        "name": [
            "Madhav Dhall's Birthday",
            "World Bicycle Day"
        ],
        "desc": [
            "Ludhiana Based <i>Full Stack Developer</i> <b>Madhav Dhall</b> was born on 3 June, 2006. He is a true Patriot and Indian. <strong>This website is owned and managed by him</strong>.",

            "The United Nations General Assembly declared 3rd June as international World Bicycle Day to recognise the uniqueness, longevity and versatility of the bicycle, which are affordable, environmentally friendly fit sustainable means of transportation."
        ]
    },
    {
        "date": "4 June",
        "name": [
            "International Day of Innocent Children Victims of Aggression"
        ],
        "desc": [
            "Every year on 4 June, The United Nation's (UN) International Day of Innocent Children Victims of Aggression is observed to raise awareness about the children who have suffered a lot throughout the world and are victims of physical, mental and emotional abuse. On this day UN affirms the commitment to protect the rights of children."
        ]
    },
    {
        "date": "5 June",
        "name": [
            "World Environment Day"
        ],
        "desc": [
            "World Environment Day is observed every year on 5 June and is celebrated by more than 100 countries. The environment is a major issue, which not only affects the well-being of the people but also hampers economic development throughout the world."
        ]
    },
    {
        "date": "7 June",
        "name": [
            "World Food Safety Day"
        ],
        "desc": [
            "World Food Safety Day is celebrated on 7 June to draw global attention to the consequences of contaminated food and water to the health. Also, this day focuses on the way to reduce the risk of food poisoning. Safety of food is a key to achieve the Sustainable Development Goals."
        ]
    },
    {
        "date": "8 June",
        "name": [
            "World Brain Tumour Day",
            "World Oceans Day"
        ],
        "desc": [
            "It is observed every year on 8 June to raise international public attention to the people that are suffering from serious disease and the urgent need for more research. Several events are organised around the world to educate about brain tumours.",

            "World Oceans Day is celebrated on 8 June every year to empower people of all ages to become leaders of their own and stop polluting ocean, water bodies. This day spread awareness about to reduce single-use plastics and to take action necessary to bring real change."
        ]
    },
    {
        "date": "12 June",
        "name": [
            "World Day Against Child Labour"
        ],
        "desc": [
            "This day is launched by the International Labour Organisation (ILO) to focus attention on the worldwide extinct of child labour, efforts and the action required to eliminate it. In 2015, world leaders adopted the Sustainable Development Goals (SDGs) in which they have included a clause to end child labour. "
        ]
    },
    {
        "date": "14 June",
        "name": [
            "World Blood Donor Day"
        ],
        "desc": [
            "World Blood Donor Day is observed on 14 June every year to raise awareness about the urgency of blood donations all over the world and to acknowledge and appreciate blood donors for their support."
        ]
    },
    {
        "date": "15 June",
        "name": [
            "World Wind Day",
            "World Elder Abuse Awareness Day"
        ],
        "desc": [
            "Every year World Wind day is observed on 15 June globally to promote clean energy. It is a day to discover wind energy, its power and the possibilities it holds to reshape our energy systems, decarbonise our economies and increase jobs and growth.",

            "This day is celebrated every year on 15 June to raise voice for caring elders. Elder abuse is a global social issue which affects the Health and Human Rights of millions of older persons around the world. This day was officially recognised by the United Nations General Assembly and request with the world to prevent elder abuse."
        ]
    },
    {
        "date": "17 June",
        "name": [
            " Martyrdom of Guru Arjan Dev"
        ],
        "desc": [
            "The Mughal Emperor Jahangir ordered to be tortured and sentenced to death to the fifth Sikh Guru Arjan Dev on 16 June, 1606. Accordingly, on 16 June every year, the Sikhs commemorate the martyrdom of Guru Arjan Dev."
        ]
    },
    {
        "date": "18 June",
        "name": [
            "Autistic Pride Day",
            "International Picnic Day"
        ],
        "desc": [
            "Every year it is observed on 18 June to represent diversity and infinite possibilities. This is a day for the patients suffering from autism to come together with their families or caregivers. A day to promote awareness, acceptance and autonomy.",

            "International Picnic Day is celebrated on 18 June every year. This is a day to enjoy in nature, with your near and dear ones."
        ]
    },
    {
        "date": "19 June",
        "name": [
            "World Sickle Cell Awareness Day",
            "World Sauntering Day"
        ],
        "desc": [
            "World Sickle Cell Awareness Day is held annually since 2008 to raise awareness about Sickle Cell Disease (SCD) and the struggle that the sufferers or a patient family face. This day was officially adopted by the General Assembly of the United Nation, to recognise SCD as a public health concern.",

            "This day is observed annually to make people remind to slow down and enjoy life as possible instead of rushing always. This day also reminds us to take easy, take time to smell roses, take time to see nature that it is so beautiful, look at the sky and enjoy life."
        ]
    },
    {
        "date": "20 June",
        "name": [
            "World Refugee Day (International)"
        ],
        "desc": [
            "This day is observed annually on 20 June to raise awareness about the struggles that refugee face around the world. World Refugee Day also marks a key moment for the public to show support for families forced to flee."
        ]
    },
    {
        "date": "21 June",
        "name": [
            "World Music Day",
            "World Hydrography Day",
            "International Yoga Day ",
            "Summer Solstice"
        ],
        "desc": [
            "Every year World Music Day is celebrated on 21 June to promote music on an international level and is a way to establish global harmony through the music.",

            "World Hydrography Day is observed on 21 June every year to increase public awareness about hydrography science. Every year the International Hydrographic Organisation (IHO) and its international members celebrate this day. 2019 theme is 'hydrographic information driving marine knowledge'.",

            "International Yoga day is celebrated across the globe on 21 June to raise awareness about yoga in life and to make people aware of the benefits through yoga. In India, International Yoga Day is celebrated by the Ministry of AYUSH.",

            "Summer Solstice is observed on 21, June. It is the longest day in India with the longest period of daylight."
        ]
    },
    {
        "date": "23 June",
        "name": [
            "International Olympic Day",
            "United Nations Public Service Day"
        ],
        "desc": [
            "The International Olympic Day is celebrated on 23rd June every year to make people aware of the importance of games in life. Olympic Day is much more than a sports event. It is a day for the world to get active.",

            "This day is designated by the UN General Assembly to celebrate 23rd June as Public Service Day.  It highlights the contribution of public service in the development process, recognises the work of public servants and encourages young people to pursue careers in public sectors."
        ]
    },
    {
        "date": "26 June",
        "name": [
            " International Day against Drug Abuse and Illicit Trafficking",
            "International Day in Support of Victims of Torture"
        ],
        "desc": [
            "This day was observed on 26 June every year to make people aware of the harmful effects of drugs and to determine a society free of drug abuse. It was established by the United Nations General Assembly to strengthen global action and cooperation.",

            "The UN General Assembly proclaimed 26 June as International Day in Support of Victims of Torture on 12 December, 1997 to eradicate torture and the effective functioning of the Convention against Torture and other cruel, inhuman or degrading treatment or punishment."
        ]
    },
    {
        "date": "30 June",
        "name": [
            "World Asteroid Day"
        ],
        "desc": [
            "Asteroid Day is an event observed on 30 June to provide online education about the asteroid. This event is held on the anniversary of the Siberian Tunguska event that took place on 30 June, 1908. It is a most harmful known asteroid related event on Earth in recent history. The United Nations passed a resolution for celebrating 30 June as Asteroid Day."
        ]
    }
]