[
    {
        "date": "1 March",
        "name": [
            "Zero Discrimination Day",
            "World Civil Defence Day"
        ],
        "desc": [
            "Zero Discrimination Day is celebrated globally on 1 March every year so that everyone lives life with dignity regardless of age, gender, ethnicity, skin colour, height, weight, etc. The symbol of Zero Discrimination Day is the butterfly. Firstly, on 1 March, 2014 the UN had celebrated this day.",

            "World Civil Defence Day is celebrated every year on 1st March to bring the attention of the world public about the importance of Civil protection and to pay tributes to the efforts, sacrifices, and accomplishments of all the services responsible to fight against disasters. International Civil Defence Organisation (ICDO) decided to celebrate this day in 1990. The theme of World Civil Defence Day 2019 is 'Children's safety, our responsibility'."
        ]
    },
    {
        "date": "3 March",
        "name": [
            "World Wildlife Day",
            "World Hearing Day"
        ],
        "desc": [
            "This day is celebrated globally on 3rd March and is closely aligns with the Sustainable Development Goal 12 that is Life without water, which focuses on marine species and to highlight the problems, critical issues of marine wildlife to our everyday life.",

            "World Hearing Day is observed on 3rd March every year to raise awareness about how to prevent deafness and to promote hearing across the world."
        ]
    },
    {
        "date": "4 March",
        "name": [
            " National Safety Day"
        ],
        "desc": [
            "National Safety Day is celebrated in India on 4th March by the National Safety Council of India. This day is celebrated to make people get safe from several issues like financial loss, health problems and also any other problems that people are facing in their life."
        ]
    },
    {
        "date": "8 March",
        "name": [
            " International Women's Day",
            "Ramakrishna Jayanti"
        ],
        "desc": [
            "This day is observed globally every year on 8 March to celebrate the social, economic, cultural and political achievements of women. Also, it is an action for accelerating gender parity. Purple is the colour which symbolise women internationally. The combination of the purple, green and white colour is to symbolise the equality of women's which is originated from the Women's Social and Political Union in the UK in 1908. Do you know that purple signifies justice and dignity, green symbolises hope and white purity?",

            "On this day the birth anniversary of Saint Ramakrishna is celebrated. According to him, 'the sole point of human birth is to acknowledge God'."
        ]
    },
    {
        "date": "10 March",
        "name": [
            "CISF Raising Day"
        ],
        "desc": [
            "The Central Industrial Security Force (CISF) Raising Day is observed every year on 10 March. The CISF was set up in 1969 under an act of the Parliament of India. It works under the Union Ministry of Home Affairs and it’s headquarter is in New Delhi. This organisation works for seaways, airways and some of the major installations in India. There are some reserved battalions in the CISF which work with the state police to protect law and orders."
        ]
    },
    {
        "date": "12 March",
        "name": [
            "Mauritius Day"
        ],
        "desc": [
            "Mauritius Day is celebrated annually on 12 March to mark two key events that took place in the history of the country that is independence from Britain in 1968 and it became a republic in 1992."
        ]
    },
    {
        "date": "13 March",
        "name": [
            " World Sleep Day"
        ],
        "desc": [
            "World Sleep Day is celebrated on 13 March, 2020. It is a call to action on important issues related to sleep, including medicine, education, social aspects, and driving. The slogan of World Sleep Day is Better Sleep, Better Life, Better Planet. "
        ]
    },
    {
        "date": "14 March",
        "name": [
            "Pi Day",
            " International Day of Action for Rivers"
        ],
        "desc": [
            "On 14 March Pi Day is celebrated around the world. Pi is a symbol used in mathematics to represent a constant. It is the ratio of the circumference of a circle to its diameter which is approx. 3.14.",

            "Every year on 14 March, International Day of Action for Rivers is observed to raise voice to protect rivers and demand for improving the policies for Rivers. It is a day to educate one another about the threats facing our rivers and to find solutions."
        ]
    },
    {
        "date": "15 March",
        "name": [
            "World Consumer Rights Day"
        ],
        "desc": [
            "It is observed on 15 March every year for raising global awareness about consumer rights and needs. This day is a chance to demand that the rights of all consumers are respected and protected and to protest against social injustices."
        ]
    },
    {
        "date": "16 March",
        "name": [
            "National Vaccination Day"
        ],
        "desc": [
            "On 16 March every year, National Vaccination Day is observed in India which is also known as National Immunisation Day (IMD). It was first observed on 16 March, 1995 when the first dose of Oral Polio Vaccine was given. It is an attempt to increase awareness for the eradication of polio from the planet earth."
        ]
    },
    {
        "date": "18 March",
        "name": [
            "Ordnance Factories Day (India)"
        ],
        "desc": [
            "On 18th March, Ordnance Factories Day is observed every year all over India. On this occasion, the Ordnance Factory, Field Gun Factory, Small Arms Factory, Ordnance Parachute Factory, and Ordnance Equipment Factory acknowledge the day."
        ]
    },
    {
        "date": "20 March",
        "name": [
            " International Day of Happiness",
            " World Sparrow Day",
            "World Oral Health Day"
        ],
        "desc": [
            "International Day of Happiness is observed every year on 20 March. Since 2013, the United Nations has celebrated this day to recognise the importance of happiness in the lives of people around the world. The UN launched the 17 Sustainable Development Goals in 2015 to end poverty, reduce inequality and protect our planet which are the three key aspects that lead to well-being and happiness.",

            "World Sparrow Day is celebrated across the world on 20 March to raise awareness about the conservation of sparrows. This day also celebrates the relationship between people and sparrows; spread a love for sparrows, awareness about their importance in our lives, etc.",

            "World Oral Health Day is celebrated on 20 March to raise awareness about oral health."
        ]
    },
    {
        "date": "21 March",
        "name": [
            "World Forestry Day",
            " World Down Syndrome Day",
            "World Poetry Day"
        ],
        "desc": [
            "On 21st March, World Forestry Day or International Day of Forests is celebrated every year to raise public awareness about the values, significance and contributions of the forests to balance the life cycle on the earth. In 1971, World Forestry Day was established at the 23rd General Assembly of the European Confederation of Agriculture.",

            "World Down Syndrome Day is observed every year on 21st March. Down syndrome is a naturally occurring chromosomal arrangement in human which results in variable effects on learning styles, physical characteristics or health. The General Assembly has declared 21st March in December 2011 as World Down Syndrome Day.",

            "On 21st March, World Poetry Day is celebrated every year to recognise the unique ability of poetry to capture the creative spirit of the human mind. To celebrate this day on 21st March was adopted during UNESCO's 30th session in Paris in 1999."
        ]
    },
    {
        "date": "22 March",
        "name": [
            "World Water Day"
        ],
        "desc": [
            "On 22 March, World Water Day is observed annually to raise awareness about the importance of freshwater and advocating for the sustainable management of freshwater resources. It was recommended to celebrate in 1992 at the United Nations Conference on Environment and Development (UNCED) in Rio de Janerio. And then, in 1993 the first World Water Day is celebrated"
        ]
    },
    {
        "date": "23 March",
        "name": [
            "World Meteorological Day"
        ],
        "desc": [
            "World Meteorological Day is celebrated on 23rd March every year to attract attention towards weather and climate for the safety and wellbeing of the society. On 23rd March, 1950, the World Meteorological Organisation came into force. The theme chosen for this day reflects topical weather, climate or water-related issues."
        ]
    },
    {
        "date": "24 March",
        "name": [
            "World Tuberculosis (TB) Day"
        ],
        "desc": [
            "World TB Day is celebrated every year on 24 March annually to commemorate the date when Dr. Robert Koch announced his discovery of Mycobacterium tuberculosis, the bacillus that causes TB in 1882. This Day is observed to educate people about TB, its impact around the world."
        ]
    },
    {
        "date": "27 March",
        "name": [
            "World Theatre Day"
        ],
        "desc": [
            "World Theatre Day is celebrated on 27 March annually across the world since 1962 to raise the importance of the art form 'theatre' and to act as a wakeup call for governments, politicians, and institutions which have not yet recognised its value to the people and also have not realised its potential for economic growth."
        ]
    }
]