[
    {
        "date": "1 May",
        "name": [
            "International Labour Day or May Day",
            "Maharashtra Day",
            "Gujarat Day"
        ],
        "desc": [
            "International Labour Day is also known as Labour Day or May Day. It is celebrated globally every year on 1st May. In India, Labour Day is referred as Antarrashtriya Shramik Diwas or Kamgar Din. What is the history behind celebrating this day etc. is given in the link provided.",

            "It is also known as Maharashtra Diwas in Marathi. It is a state holiday in Maharashtra. The state of Maharashtra was formed from the division of the Bombay State on 1 May, 1960.",

            " It is a state holiday in Gujarat. The state of Gujarat was formed on 1 May, 1960."
        ]
    },
    {
        "date": "2 May",
        "name": [
            " World Tuna Day"
        ],
        "desc": [
            "It is observed on 2 May and is established by the United Nations (UN) to raise awareness about the importance of tuna fish."
        ]
    },
    {
        "date": "3 May",
        "name": [
            " Press Freedom Day"
        ],
        "desc": [
            "Every year Press freedom Day or World Press Freedom Day is observed on 3rd May to evaluate press freedom around the world and to pay tribute to journalists who have lost their lives in the exercise of their profession. "
        ]
    },
    {
        "date": "4 May",
        "name": [
            " Coal Miners Day",
            "International Firefighter’s Day"
        ],
        "desc": [
            "Every year on 4 May, Coal Miners Day is observed to honour the coal miners. Let us tell you that Coal mining is done to extract coal from the ground. Coal Mining is one of India's most dangerous professions. Coal Miners are the men who know that they may not return home back after the work when the day is over. Then, also they walk in the coal mines and earn their daily wages.",

            "International Firefighter’s Day is observed every year on 4 May. It was instituted on 4 January, 1999 after a proposal via emailed out across the world due to the deaths of five firefighter’s in a bushfire in Australia. Therefore, this day is observed to recognise and honour the sacrifices that firefighter’s make to ensure that their communities and environment are as safe as possible."
        ]
    },
    {
        "date": "5 May",
        "name": [
            " World Laughter Day (first Sunday of May)"
        ],
        "desc": [
            "World Laughter Day is celebrated on the first Sunday of May every year. In 1998, the first celebration took place in Mumbai, India. It was arranged by Dr. Madan Kataria founder of the worldwide Laughter Yoga movement."
        ]
    },
    {
        "date": "7 May",
        "name": [
            "World Asthma Day (First Tuesday of May)",
            "World Athletics Day",
            " Rabindranath Tagore Jayanti"
        ],
        "desc": [
            "World Asthma Day is observed every year on the first Tuesday of May to spread awareness and care about asthma in the world. An annual event is organised by the Global Initiative for Asthma. Asthma is a chronic inflammation of bronchitis causing cough, breathlessness, chest tightness etc.",

            "This year World Athletics Day is observed on 7 May to raise awareness about sports among youth, in schools and institutions to promote athletics as the primary sport. And to introduce new talent and youngsters in the field of athletics.",

            "The birth anniversary of Rabindranath Tagore is observed on 7 May according to Gregorian Calendar. He was born on 7 May, 1861 in Kolkata. He was one of India's top artists, novelist, author, Bengali poet, humanist, philosopher etc. In 1913, he was honoured with Nobel Prize in Literature."
        ]
    },
    {
        "date": "8 May",
        "name": [
            " World Red Cross Day",
            " World Thalassaemia Day"
        ],
        "desc": [
            "World Red Cross Day is observed every year on 8 May to commemorate the birth anniversary of the founder of the Red Cross. Let us tell you that the founder of Red Cross was Henry Dunant as well as the founder of the International Committee of the Red Cross (ICRC). He was born in Geneva in 1828. He became the first recipient of the 1st Nobel Peace prize.",

            "World Thalassaemia Day or International Thalassaemia Day is observed every year on 8 May in honour of all patients suffering from Thalassaemia and for their parents who have never lost hope for life, despite the burden of their disease. This day also encourages those who struggle to live with the disease. "
        ]
    },
    {
        "date": "11 May",
        "name": [
            " National Technology Day"
        ],
        "desc": [
            "Every year National Technology Day is observed on 11 May to highlight the important role of Science in our daily lives and encourage students to opt science as an option for a career. On this day Shakti, the Pokhran nuclear test was held on 11 May, 1998."
        ]
    },
    {
        "date": "12 May",
        "name": [
            "International Nurses Day"
        ],
        "desc": [
            "Every year International Nurses Day is celebrated on 12 May to commemorate the anniversary of Florence Nightingale's birthday. This day also celebrates the contribution done by the nurses to society around the world. On this day the International Council of Nurses organisation produces an International Nurses kit to educate and assist health workers globally with a different theme every year."
        ]
    },
    {
        "date": "15 May",
        "name": [
            "International Day of Families"
        ],
        "desc": [
            "International Day of Families is observed every year on 15 May. Family is the basic unit of society. This day provides an opportunity to raise awareness about the issues related to the families and to increase knowledge about the social, economic and demographic processes that affect them. Several awareness-raising events, including national family day, occur."
        ]
    },
    {
        "date": "17 May",
        "name": [
            " World Telecommunication Day",
            " World Hypertension Day"
        ],
        "desc": [
            "World Telecommunication Day is observed every year on 17 May. It marks the founding of ITU when the first International Telegraph Convention was signed in Paris on 17 May, 1865. It is also known as World Telecommunication and International Society Day. Since 1969, it has been celebrating annually.",

            "This day is celebrated by World Hypertension League (WHL) on 17 May annually. The day promotes awareness about hypertension and to encourage people to prevent and control this silent killer epidemic."
        ]
    },
    {
        "date": "18 May",
        "name": [
            "World AIDS Vaccine Day",
            " International Museum Day"
        ],
        "desc": [
            "Worlds AIDS Vaccine Day or HIV Vaccine Awareness Day is observed every year on 18 May. This day marks the efforts of thousands of researchers, scientists, health professionals who have contributed to the process of finding safe and effective AIDS medicine. It is also an opportunity to educate communities about the importance of preventive HIV vaccine research.",

            "International Museum Day is observed on 18 May every year to raise awareness about the museum and their role in society. The International Council of Museums (ICOM) created International Museum Day in 1977. The organisation suggested a proper theme every year which may include globalisation, bridging cultural gaps and care for the environment."
        ]
    },
    {
        "date": "21 May",
        "name": [
            "National Anti-Terrorism Day"
        ],
        "desc": [
            "National Anti-Terrorism Day is observed every year on 21 May to spread awareness about the violence caused by the terrorists and also in the memory of former Indian PM Rajiv Gandhi who passed on this day."
        ]
    },
    {
        "date": "22 May",
        "name": [
            "International Day for Biological Diversity"
        ],
        "desc": [
            "International Day for Biological Diversity is observed on 22 May every year to increase awareness and understanding of the issues of biodiversity. "
        ]
    },
    {
        "date": "31 May",
        "name": [
            "Anti-Tobacco Day"
        ],
        "desc": [
            "Anti-Tobacco Day or World No Tobacco Day is observed on 31 May every year across the globe to make people aware and educate them about the harmful effects of tobacco on health which causes cardiovascular diseases, cancer, tooth decay, staining of teeth etc."
        ]
    }
]