[
    {
        "date": "1 November",
        "name": [
            " World Vegan Day",
            "All Saint's Day"
        ],
        "desc": [
            "World Vegan Day is celebrated on 1st November to raise awareness about the benefits of a vegan diet and veganism in general. On 1st November 1994, the first Vegan Day was established to commemorate the 50th anniversary of the UK Vegan Society.",

            "On 1 November, All Saints' Day is celebrated to praise all saints'. All Saints' Day is also known as All Hallows' Day or Hallowmas. <br/> Note: Do you know the whole November month is also observed as No-Shave November. The aim of No-Shave November is to raise cancer awareness by not shaving or cutting men's facial hair for the entire month of November."
        ]
    },
    {
        "date": "2 November",
        "name": [
            "All Souls' Day"
        ],
        "desc": [
            "All Souls' Day is observed on 2nd November annually to honour the dead souls. In Roman Catholicism, this day commemorates all those souls who are faithfully departed and are believed to be in purgatory because they died with the guilt of lesser sins on their souls."
        ]
    },
    {
        "date": "5 November",
        "name": [
            "World Tsunami Awareness Day",
            " Bhupen Hazarika Death",
            "Virat Kohli Birthday"
        ],
        "desc": [
            "World Tsunami Awareness Day is observed on 5 November to highlight the dangers of tsunami and to focus on the importance of the early warning systems to minimise the damage caused due to the natural hazard. This day also provides traditional knowledge about tsunamis.",

            "Bhupen Hazarika was a poet, music composer, singer, actor, journalist, author and film-maker. He was born on 8 September, 1926 , Tinsukia district, Assam. He died on 5 November, 2011 in Mumbai.",

            "Virat Kohli was born on 5 November 1988 in Delhi. In all the formats of international cricket, he has completed 20,000 runs in the international cricket with the help of 68 centuries and 6 double centuries."
        ]
    },
    {
        "date": "7 November",
        "name": [
            "Infant Protection Day",
            "National Cancer Awareness Day",
            "Chandrasekhara Venkata Raman Birthday"
        ],
        "desc": [
            "Infant Protection Day is observed on 7 November to spread awareness regarding protecting, promoting and developing infants. No doubt infants are tomorrow’s citizens. Therefore, it is necessary to protect them as they are the future of the world.",

            "National Cancer Awareness Day is observed on 7 November to spread awareness about cancer and to make it global health priority. In 2014, National Cancer Awareness Day was started by the announcement of the former Union Health Minister Dr. Harsh Vardhan.",

            "Chandrasekhara Venkata Raman (C.V Raman) was born on 7 November, 1888 in Tiruchirapalli, Tamil Nadu. He became the first Indian to receive Nobel Prize in 1930 in Physics."
        ]
    },
    {
        "date": "9 November",
        "name": [
            "Iqbal Day",
            "Legal Services Day",
            "Uttarakhand Foundation Day",
            "Kartarpur Corridor inauguration"
        ],
        "desc": [
            "Iqbal Day is celebrated in Pakistan to commemorate the contribution of Allama Muhammad Iqbal for the Muslims. He was born on 9 November, 1877 and played an important role in the Pakistan Movement.",

            "Legal Services Day is observed on 9 November in India to raise awareness among the people where Legal Literacy is lacking. On this day, in 1995, the Legal Services Authorities Act was enforced.",

            "Uttarakhand was established on 9 November 2000. This year 19th Uttarakhand Foundation Day was celebrated. When it was formed its name was Uttaranchal and in 2007, it was changed to Uttarakhand formally. It is famous as the Land of Gods or 'Dev Bhumi'.",

            "Kartarpur Corridor was inaugurated on 9 November 2019 by Prime Minister Narendra Modi in India and by Imran Khan in Pakistan. Guru Nanak Dev Ji, the first Sikh Guru established Kartarpur Sahib Gurudwara in 1552. It has religious importance."
        ]
    },
    {
        "date": "11 November",
        "name": [
            "Armistice Day (Remembrance Day)"
        ],
        "desc": [
            "Armistice Day is observed on 11 November and is also known as Láemistice de la Premiere Guerre Mondiale in France. This day is observed in the commemoration of the end of World War I. Some countries also call it Remembrance Day. Let us tell you that on 11 November 1918, an armistice was signed between the Allied Forces and Germany at Compiegne in northern France."
        ]
    },
    {
        "date": "12 November",
        "name": [
            "World Pneumonia Day"
        ],
        "desc": [
            "World Pneumonia Day is observed on 12 November to raise awareness about Pneumonia and its prevention. It is the world's leading infectious disease due to which children below 5 years are much more affected."
        ]
    },
    {
        "date": "13 November",
        "name": [
            "World Kindness Day"
        ],
        "desc": [
            "World Kindness Day is celebrated on 13 November and this day provides us an opportunity to reflect and follow the most important and one of the unique human principles. This day promotes small acts of kindness and brings people together."
        ]
    },
    {
        "date": "14 November",
        "name": [
            "World Diabetes Day",
            "Children's Day",
            "Jawaharlal Nehru Jayanti"
        ],
        "desc": [
            "World Diabetes Day is observed on 14 November to raise awareness about the impact of diabetes disease, its prevention, and education of diabetes.",

            "Children's Day is celebrated on 14 November in India and is also known as Bal Divas. This day increase awareness in people about the rights, care, and education of children. Children are the future of the country. This day commemorates the birth anniversary of the first Prime Minister of India, Jawaharlal Nehru.",

            "Jawaharlal Nehru was born on 14 November, 1889 in Allahabad, Uttar Pradesh. His birthday is also celebrated as Children's Day in India. He was the first Prime Minister of Independent India."
        ]
    },
    {
        "date": "15 November",
        "name": [
            "Jharkhand Foundation Day"
        ],
        "desc": [
            "Jharkhand was established on 15 November 2000 by the Bihar Reorganisation Act as the 28th State of India."
        ]
    },
    {
        "date": "16 November",
        "name": [
            "International Day for Tolerance"
        ],
        "desc": [
            "International Day for Tolerance is observed on 16 November to raise awareness about strengthening tolerance by encouraging mutual understanding among cultures and peoples. The UN General Assembly in 1966 by resolution 51/95 invited the UN Member States to observe the International Day for Tolerance on 16 November."
        ]
    },
    {
        "date": "17 November",
        "name": [
            "National Epilepsy Day"
        ],
        "desc": [
            "National Epilepsy Day is observed on 17 November to focus on the epilepsy disease, its symptoms, and prevention. Let us tell you that Epilepsy is a chronic disorder of the brain which is characterised by recurrent 'seizures' or 'fits'. It can affect people of any age and people in the different age groups have unique concerns and problems."
        ]
    },
    {
        "date": "19 November",
        "name": [
            "International Men's Day",
            "World Toilet Day"
        ],
        "desc": [
            "International Men's Day is celebrated on 19 November. The theme for International Men’s Day 2020 is 'Better health for men and boys'. This day highlights the issues faced by men on a global scale.",

            "World Toilet Day is observed on 19 November annually to inspire people about tackling the issue of the global sanitation crisis and to achieve Sustainable Development Goal (SDG) 6, which promises sanitation for all by 2030. According to WHO and UNICEF around 60% of the global population that is approx 4.5 billion people either have no toilet at home or one that does not safely manage excreta."
        ]
    },
    {
        "date": "20 November",
        "name": [
            "Universal Children's Day",
            "Africa Industrialisation Day"
        ],
        "desc": [
            "Universal Children's Day is observed on 20 November annually to promote international togetherness, awareness among children worldwide, and improving children's welfare. It was established in 1954. ",

            "Africa Industrialisation Day is celebrated on 20 November to raise worldwide about the problems and challenges of industrialisation in Africa. This day also draws attention to the governments and other organisations in several African countries to examine ways to stimulate the industrialisation process of Africa."
        ]
    },
    {
        "date": "17 November",
        "name": [
            "International Day for the Eradication of Poverty"
        ],
        "desc": [
            "International Day for the Eradication of Poverty is observed on 17 November every year. This day marks the adoption of the Convention on the Rights of the Child (UNCRC) on 20 November 1989. "
        ]
    },
    {
        "date": "20 November",
        "name": [
            "World Statistics Day"
        ],
        "desc": [
            "World Statistics Day is celebrated every five years on November 20. The first such day was observed on November 20, 2010. This year the world witnessed the third World Statistics Day. The day was created by the United Nations Statistical Commission to acknowledge the importance of data authenticity and credibility across the globe. "
        ]
    },
    {
        "date": "21 November",
        "name": [
            "World Television Day"
        ],
        "desc": [
            "World Television Day is celebrated on 21 November every year. According to the UN, this day highlights the major role that television plays in daily life by presenting different issues that affect people. UN General Assembly on 17 December, 1996 proclaimed 21 November as World Television Day."
        ]
    },
    {
        "date": "25 November",
        "name": [
            "International Day for the Elimination of Violence against Women"
        ],
        "desc": [
            "This day was established by the UN General Assembly in 1993. It defines violence against women as an act of gender-based violence that results in physical, sexual, or psychological harm or suffering to women, including threats, etc."
        ]
    },
    {
        "date": "26 November",
        "name": [
            "Constitution Day of India"
        ],
        "desc": [
            "Law day is also known as Constitution Day or Samvidhan Divas. It is observed on 26 November to commemorate the adoption of the Constitution of India. The Constituent Assembly of India adopted the Constitution of India on 26 November, 1949 and it came into effect on 26 January, 1950."
        ]
    },
    {
        "date": "29 November",
        "name": [
            "International Day of Solidarity with Palestinian People"
        ],
        "desc": [
            "The General Assembly in 1977 by the adoption of resolution 32/40 B declared 29 November as the International Day of Solidarity with the Palestinian People. On this day, the Assembly adopted resolution 181 (II) on the partition of Palestine in 1947."
        ]
    },
    {
        "date": "30 November",
        "name": [
            "Saint Andrew's Day"
        ],
        "desc": [
            "St. Andrew's Day is celebrated on 30 November every year in Scotland and especially in the countries where Saint Andrew is the patron saint like Barbados, Bulgaria, Columbia, Cyprus, Greece, Romania, Russia, Scotland, and Ukraine."
        ]
    }
]