[
    {
        "date": "1 October",
        "name": [
            "International Day of the Older Persons",
            "International Coffee Day",
            "World Vegetarian Day"
        ],
        "desc": [
            "International Day of the Older Persons is observed on 1 October every year to raise problems faced by elder persons and to promote the development of a society for all ages. The United Nations General Assembly adopted a resolution on 14 December, 1990, and designates 1 October as the International Day of Older Persons.",

            "International Coffee Day is celebrated on 1 October every year to recognise millions of people across the world from farmers, roasters, baristas, and coffee shop owners, etc. who do hard work to create and serve the beverage in the consumable form.",

            "World Vegetarian Day is observed on 1 October annually. It was founded in 1977 by the North American Vegetarian Society (NAVS) and in 1978 was endorsed by the International Vegetarian Union."
        ]
    },
    {
        "date": "2 October",
        "name": [
            "Gandhi Jayanti",
            "International Day of Non-Violence"
        ],
        "desc": [
            "Gandhi Jayanti is celebrated on 2nd October every year to mark the birth anniversary of Mahatma Gandhi. He was born on 2 October, 1869 in Porbandar, Gujarat. He is an inspiration in the lives of the famous world leaders and our lives also.",

            "International Day of Non-Violence is observed on 2 October to mark the birthday of Mahatma Gandhi who had played an important role in India's Independence. On 15 June, 2007, General Assembly adopted a resolution of establishing the International Day of Non-Violence to spread the message of non-violence including education and public awareness."
        ]
    },
    {
        "date": "3 October",
        "name": [
            "German Unity Day"
        ],
        "desc": [
            "German Unity Day is celebrated on 3 October every year to mark the anniversary of the nation's unification. On 3 October, 1990, the Federal Republic of Germany and the Democratic Republic of Germany were united as one single federal Germany."
        ]
    },
    {
        "date": "4 October",
        "name": [
            "World Animal Welfare Day"
        ],
        "desc": [
            "World Animal Welfare Day is celebrated on 4 October to raise awareness among people about taking actions worldwide for the rights of animals as well as welfare. It is necessary to improve welfare standards worldwide."
        ]
    },
    {
        "date": "5 October",
        "name": [
            "World Teachers' Day"
        ],
        "desc": [
            "World Teachers' Day is celebrated on 5 October every year in the whole world to commemorate the anniversary of the adoption of the ILO/UNESCO Recommendation concerning the Status of Teachers in 1966. No doubt this Recommendation sets benchmarks regarding the rights and responsibilities of teachers, education, recruitment, employment, etc."
        ]
    },
    {
        "date": "6 October",
        "name": [
            "German-American Day"
        ],
        "desc": [
            "German-American Day is observed on 6 October every year. This day is celebrated as the German-American heritage."
        ]
    },
    {
        "date": "8 October",
        "name": [
            "Indian Air Force Day"
        ],
        "desc": [
            "Indian Air Force Day is celebrated on 8 October all over India. On 8 October, 1932 Indian Air Force Day was established."
        ]
    },
    {
        "date": "9 October",
        "name": [
            "World Post Day "
        ],
        "desc": [
            "World Postal Day is celebrated on 9 October every year to raise awareness among people about the role of the postal sector for people and businesses every day. In 1874, the Universal Postal Union was established in Bern, Switzerland and its anniversary is declared as the World Postal Day by the Universal Postal Union Congress in Tokyo, Japan in 1969."
        ]
    },
    {
        "date": "10 October",
        "name": [
            "World Mental Health Day"
        ],
        "desc": [
            "World Mental Health Day is observed on 10 October every year to raise awareness about the scale of suicide around the world and the role that each of us can play to help in preventing it. This day is organised by the World Federation for Mental Health. It is also supported by WHO, the International Association for Suicide Prevention, and United for Global Mental Health."
        ]
    },
    {
        "date": "11 October",
        "name": [
            "International Day of the Girl Child"
        ],
        "desc": [
            "International Day of the Girl Child is observed on 11 October to raise voices for girls and stand up for their rights."
        ]
    },
    {
        "date": "13 October",
        "name": [
            "International Day for Disaster Risk Reduction"
        ],
        "desc": [
            "International Day for Natural Disaster Reduction is observed annually on 13 October to raise awareness about the risk of disaster reduction. In 1989, the International Day of Disaster Risk Reduction was started by the United Nations General assembly. "
        ]
    },
    {
        "date": "14 October",
        "name": [
            "World Standards Day"
        ],
        "desc": [
            "World Standards Day is observed on 14 October every year to raise awareness among the regulators, industry, and consumers to show the importance of standardization to the global economy."
        ]
    },
    {
        "date": "15 October",
        "name": [
            "Global Handwashing Day",
            "World White Cane Day",
            "World Students’ Day"
        ],
        "desc": [
            "Global Handwashing Day is observed on 15 October every year and it was founded by the Global Handwashing Partnership. This day provides an opportunity to design, test and replicate creative ways to encourage people to wash their hands with soap at critical times. In 2008, the first Global Handwashing Day was celebrated.",

            "World White Cane Day is celebrated on 15 October by the National Federation of the Blind. White cane for the blind people is an essential tool that gives them the ability to achieve a full and independent life. With the help of white cane, they can move freely and safely from one place to another.",

            "World Students’ Day is observed on 15 October annually to mark the birth anniversary of A.P.J. Abdul Kalam. This day honours and pays respect to him and his efforts in the field of science and technology and also the role of the teacher that he played throughout his scientific and political careers."
        ]
    },
    {
        "date": "16 October",
        "name": [
            "World Food Day",
            "World Anaesthesia Day",
            "Boss Day",
            "World Spine Day"
        ],
        "desc": [
            "World Food Day is celebrated every year on 16 October to inspire people about healthy diets. On this day Food and Agriculture Organisation was established and launched by the United Nations in 1945.",

            "World Anaesthesia Day is celebrated on October 16 to mark the first successful demonstration of diethyl ether anaesthesia in 1846.",

            "National Boss Day or Boss's Day is celebrated on 16 October to appreciate the works of their employers. The day also acknowledges the hard work, dedication, and challenges faced by the managers or superiors in an organisation.",

            "It is observed on 16 October to highlights the burden of spinal pain and disability around the world."
        ]
    },
    {
        "date": "17 October",
        "name": [
            "International Day for the Eradication of Poverty"
        ],
        "desc": [
            "International Day for the Eradication of Poverty is observed on 17 October every year. This day marks the adoption of the Convention on the Rights of the Child (UNCRC) on 20 November 1989. "
        ]
    },
    {
        "date": "20 October",
        "name": [
            "World Statistics Day"
        ],
        "desc": [
            "World Statistics Day is celebrated every five years on October 20. The first such day was observed on October 20, 2010. This year the world witnessed the third World Statistics Day. The day was created by the United Nations Statistical Commission to acknowledge the importance of data authenticity and credibility across the globe. "
        ]
    },
    {
        "date": "23 October",
        "name": [
            "Mole Day"
        ],
        "desc": [
            "Mole Day is observed on 23 October every year. This day commemorates Avogadro's Number which is a basic measuring unit in chemistry. This day was created to generate interest in chemistry."
        ]
    },
    {
        "date": "24 October",
        "name": [
            "United Nations Day",
            "World Development Information Day"
        ],
        "desc": [
            "United Nations Day is observed on 24 October every year to mark the anniversary of the UN Charter's entry into force. Since 1948, this day is celebrated and in 1971 it was recommended by the United Nations General Assembly to observe by the Member States as a public holiday.",

            "World Development Information Day is celebrated on 24 October every year to draw the attention of the world to development problems and the need to strengthen international cooperation to solve them."
        ]
    },
    {
        "date": "30 October",
        "name": [
            "World Thrift Day"
        ],
        "desc": [
            "World Thrift Day is observed on 30 October every year in India and in worldwide it is observed on 31st October. This day is devoted to the promotion of savings all over the world."
        ]
    },
    {
        "date": "31 October",
        "name": [
            "Rashtriya Ekta Diwas or National Unity Day"
        ],
        "desc": [
            "Rashtriya Ekta Diwas or National Unity Day is observed on 31 October every year to commemorate the birth anniversary of Sardar Vallabhai Patel. He had played an important role in unifying the country."
        ]
    }
]