[
    {
        "date": "1 September",
        "name": [
            "National Nutrition Week"
        ],
        "desc": [
            "National Nutrition Week is observed from 1st September to 7th September to provide knowledge among people about the importance of nutrition and its importance for the human body, for better health."
        ]
    },
    {
        "date": "2 September",
        "name": [
            "Victory over Japan Day or V-J Day",
            "World Coconut Day"
        ],
        "desc": [
            "On 2nd September, 1945 Japan surrendered aboard the U.S.S Missouri, anchored in Tokyo Bay and so, Victory over Japan is celebrated on 2nd September.",

            "World Coconut Day is observed on 2nd September every year to make people aware about the importance of this crop in poverty reduction. This day also commemorate the formation day of Asian Pacific Coconut Community (APCC)."
        ]
    },
    {
        "date": "3 September",
        "name": [
            "Skyscraper Day"
        ],
        "desc": [
            "Skyscraper Day is observed on 3rd September every year to commemorate the birthday of the famous architect William Can Aien who is genius in constructing the Chrysler Building which is one of the iconic landmark in New York city. This day marks the ability of the man to construct industrial masterpiece."
        ]
    },
    {
        "date": "5 September",
        "name": [
            "International Day of Charity",
            "Teachers' Day (India)"
        ],
        "desc": [
            "International Day of Charity is observed on 5 September every year to eradicate poverty in all its forms and dimensions to achieve sustainable development goals.",

            "Teachers' Day in India is celebrated on 5 September every year to mark the birth anniversary of India's second President Dr. Sarvapalli Radhakrishnan. On this day we appreciate and acknowledge the efforts of teachers in making responsible individual."
        ]
    },
    {
        "date": "7 September",
        "name": [
            "Brazilian Independence Day"
        ],
        "desc": [
            "Brazilian Independence Day is celebrated on 7 September every year to commemorate the birth of the nation. On 7 September, 1822, Brazil got its independence from Portuguese. In 1889 Brazil ended up with the monarchical system and became republic but kept 7 September as its Independence Day."
        ]
    },
    {
        "date": "8 September",
        "name": [
            "International Literacy Day",
            "World Physical Therapy Day"
        ],
        "desc": [
            "International Literacy Day is observed on 8 September every year to make people aware about the importance of literacy which no doubt is a matter of dignity and human rights. Let us tell you that it is key component of the UNs Sustainable Developmental Goals.",

            "World Physical Therapy Day is observed on 8 September every year to provide an opportunity for physical therapists from all over the world to raise awareness about the important contribution of the profession and in improving the well being and health of the people."
        ]
    },
    {
        "date": "10 September",
        "name": [
            "World Suicide Prevention Day (WSPD)"
        ],
        "desc": [
            "World Suicide Prevention Day (WSPD) is observed on 10 September every year to raise awareness to prevent the cases of suicide. This day is organised by the International Association for Suicide Prevention (IASP). And this day is co-sponsored by WHO."
        ]
    },
    {
        "date": "14 September",
        "name": [
            "Hindi Diwas",
            "World First Aid Day"
        ],
        "desc": [
            "Hindi Diwas is celebrated on 14 September as on this day the Constituent Assembly of India had adopted Hindi written in Devanagri script in 1949 as the official language of the Republic of India.",

            "World First Aid Day is observed on 14 September to raise awareness among public about how first aid can save lives in case of crises. According to the International Federation, first aid should be accessible to all people and should be an important part of the developmental societies."
        ]
    },
    {
        "date": "15 September",
        "name": [
            "Engineer's Day (India)",
            "International Day of Democracy"
        ],
        "desc": [
            "Engineer's Day is celebrated in India on 15 September every year to mark the tribute to the Indian Engineer Bharat Ratna Mokshagundam Visvesvaraya.",

            "International Day of Democracy is observed on 15 September to remind people that democracy is about people. This day provides an opportunity to make people understand the importance of democracy and the effective realisation of Human Rights."
        ]
    },
    {
        "date": "16 September",
        "name": [
            "Malaysia Day",
            "World Ozone Day"
        ],
        "desc": [
            "Malaysia Day is celebrated on 16 September and is also known as 'Hari Malaysia'. On 16 September, 1963, the former British colony of Singapore and the East Malaysian states of Sabah and Sarawak joined the Federation of Malaya to generate the Malaysian Federation.",

            "World Ozone Day is observed on 16 September annually. On this day in 1987, the Montreal Protocol was signed. Since 1994, World Ozone Day is celebrated which was established by the United Nations General Assembly. This day reminds people about the depletion of the Ozone Layer and to find solutions to preserve it."
        ]
    },
    {
        "date": "19 September",
        "name": [
            "International Talk Like a Pirate Day"
        ],
        "desc": [
            "International Talk Like a Pirate Day is celebrated on 19 September annually. In 1995, it was celebrated the first time. This day encourages people to talk and dress like the sea plunderers of yesteryears."
        ]
    },
    {
        "date": "21 September",
        "name": [
            " International Day of Peace (UN)",
            "World Alzheimer's Day"
        ],
        "desc": [
            "International Day of Peace (UN) is observed on 21 September around the world. For the first time it was observed in September 1982 and in 2001, the General Assembly adopted a resolution 55/282, which established 21 September as International Day of Peace of non-violence and cease-fire.",

            "World Alzheimer's Day is observed on 21 September to raise awareness among people about the challenges that the patient faces due to dementia. In 2012, World Alzheimer's Month was launched."
        ]
    },
    {
        "date": "22 September",
        "name": [
            "Rose Day (Welfare of Cancer patients)"
        ],
        "desc": [
            "Rose Day is observed on 21 September for the welfare of cancer patients or we can say that this day marks the hope for cancer patients that cancer is curable. This day is celebrated in the memory of a 12-year-old Melinda Rose of Canada, who when diagnosed with a rare form of blood cancer and did not give up hope."
        ]
    },
    {
        "date": "24 September",
        "name": [
            "World Maritime Day"
        ],
        "desc": [
            "World Maritime Day is observed on 24 September to raise awareness about the United Nation's Sustainable Development Goals (SDGs) and to showcase the work that the International Maritime Organization (IMO) and its Member States are undertaking to achieve the targets. The theme of this year is 'Sustainable shipping for a sustainable planet.'"
        ]
    },
    {
        "date": "26 September",
        "name": [
            "European Day of Languages"
        ],
        "desc": [
            "European Day of Languages is celebrated on 26 September annually to promote awareness among the public about the importance of language learning and protecting the heritage of the language."
        ]
    },
    {
        "date": "27 September",
        "name": [
            "World Tourism Day"
        ],
        "desc": [
            "World Tourism Day is annually celebrated on 27 September to highlight the importance of tourism which helps in generating employment and build a future for millions of people around the world."
        ]
    },
    {
        "date": "28 September",
        "name": [
            "World Rabies Day",
            "International Day For Universal Access To Information (IDUAI)"
        ],
        "desc": [
            "World Rabies Day is observed on 28 September every year to make people aware of the prevention regarding rabies and to highlight the progress in defeating this horrifying disease.",

            "International Day For Universal Access To Information (IDUAI) 2020 is observed on 28 September every year. The day focuses on the right to seek, receive, and impart information."
        ]
    },
    {
        "date": "29 September",
        "name": [
            "World Heart Day"
        ],
        "desc": [
            "World Heart Day is observed annually on 29 September. This day informs people about heart disease and stroke which is the world's leading cause of death."
        ]
    },
    {
        "date": "30 September",
        "name": [
            "International Translation Day"
        ],
        "desc": [
            "International Translation Day is observed on 30 September every year. This day provides an opportunity to pay tribute to the work of language professionals. It also plays an important role in making nations together and strengthens world peace and security."
        ]
    }
]